{"pageProps":{"frontmatter":{},"content":"# Einführung in Markdown\n\n\n## Einleitung\nMarkdown ist eine Auszeichnungssprache, also eine maschinenlesbare Sprache zur Gliederung und Formatierung von Texten und anderen Daten.  \nSie soll möglichst leicht von Menschen zu lesen sein, daher sind die Auszeichnungselemente relativ einfach.\n\n\n## Übersicht\n\n1. [Fett und Kursiv](#Fett-und-Kursiv)\n2. [Durchstreichen](#Durchstreichen)\n3. [Überschriften](#Überschriften)\n4. [Absätze](#Absätze)\n5. [Zitate](#Zitate)\n6. [Listen](#Listen)\n7. [Checklisten](#Checklisten)\n8. [Hyperlinks](#Hyperlinks)\n9. [Bilder](#Bilder)\n10. [Verlinkte Bilder](#Verlinkte-Bilder)\n11. [Tabellen](#Tabellen)\n12. [Fußnoten](#Fußnoten)\n13. [Backslash-Maskierung](#Backslash-Maskierung)  \n  \n  \n  \n## Fett und Kursiv\nUm kursiv zu schreiben, setzen Sie je ein Sternchen (Asterisk) vor und nach den Wörtern. Für Fettungen verwenden Sie zwei.  \nMöchten Sie einen Textbereich sowohl fett als auch kursiv setzen, benutzen Sie drei Sternchen. Alternativ können Sie Unterstriche verwenden.\n\n![Fett und Kursiv](/images/markdown-guide/bold-cursive.jpg)\n\n\n## Durchstreichen\nUm einen durchgestrichen Text darzustellen, nutzt man bei Markdown die Tilde zweimal hintereinander, lässt dann den entsprechenden Text folgen und schließt das Element wieder mit zwei Tilden ab. \n\n![Durchstreichen](/images/markdown-guide/crossed-out.jpg)\n\n\n## Überschriften\nUm eine Überschrift darzustellen, setzt man eine Raute mit einem Leerzeichen Abstand vor den Text.  \nUm hierarchisch tiefer liegende Überschriften zu erstellen, setzen Sie zusätzliche Rauten ein. Auf diese Weise lassen sich Überschriften und Unterüberschriften bis zur sechsten Stufe erstellen\n\n![Überschriften](/images/markdown-guide/heading.jpg)\n\n\n## Absätze\nUm einen neuen Textblock zu erstellen, fügt man eine leere Zeile ein. Es reicht, wenn die Zeile optisch leer ist (Leerzeichen o.ä. werden ignoriert).  \nMöchte man einen einfachen Zeilenumbruch erstellen, fügt man an das Ende der Zeile zwei Leerzeichen an.\n\n\n## Zitate\nUm einen Textbereich als Zitat zu kennzeichnen, verwenden Sie das Größer-als-Zeichen (>).  \nSie können entweder jede einzelne Zeile mit diesem Zeichen kennzeichnen oder nur eines an den Anfang des Absatzes setzen und den Bereich dann mit einer Leerzeile beenden.\n\n![Zitate](/images/markdown-guide/quote.jpg)\n\n\n## Listen\nUm eine unsortierte Liste zu erstellen, verwenden Sie entweder das Plus-Zeichen, den Bindestrich oder ein Sternchen. Alle drei Varianten führen zum gleichen Ergebnis.\n\n![Unsortierte Liste](/images/markdown-guide/ul.jpg)\n\nUm eine sortierte Liste zu erstellen, verwenden Sie eine Zahl mit einem direkt darauffolgenden Punkt. (Die tatsächlichen Zahlen sind dabei egal).\n\n![Sortierte Liste](/images/markdown-guide/ol.jpg)\n\n\n## Checklisten\nEine Checkliste erstelle Sie mit eckigen Klammern. Dazwischen setzen Sie entweder ein Leerzeichen oder ein X (für bereits gesetzte Häkchen).\n\n![Checkliste](/images/markdown-guide/checklist.jpg)\n\nCode\nUm einen Textbereich als Code zu kennzeichnen, setzen Sie einen Akzent (Backtik) am Anfang und am Ende ein.\n\n![Code](/images/markdown-guide/code.jpg)\n\nKommt in dem Codebeispiel selbst ein Akzent vor, verwenden Sie das Zeichen einfach doppelt.\n\n![Code](/images/markdown-guide/code2.jpg)\n\nUm einen ganzen Block als Quellcode zu markieren, kann man entweder einen Tabulator oder vier Leerzeichen verwenden – und zwar für jede Zeile.  \nUm ausgewählte Zeilen noch weiter einrücken zu lassen, fügen Sie einfach weitere Tabulatoren oder Leerzeichen hinzu. \n\n![Code](/images/markdown-guide/code3.jpg)\n\nWenn Sie Codeblöcke lieber mit einem Zeichen einleiten und beenden, können Sie den Bereich mit je drei Akzenten am Anfang und am Ende markieren.  \nAutomatische farbige Hervorhebungen sind möglich, wenn Sie hier zusätzlich nach den drei einleitenden Akzenten die Sprache des Codes angeben.\n\n![Code](/images/markdown-guide/code4.jpg)\n\n\n## Hyperlinks\nEinen Link erzeugen Sie, indem Sie den Ankertext (die im Text sichtbaren Wörter) in eckige Klammern setzen und direkt darauf in runden Klammern die URL anfügen.  \nOptional können Sie noch einen Titel hinzufügen, der erscheint, wenn man mit der Maus darüberfährt: Er steht mit einem Leerzeichen getrennt und in doppelten Anführungszeichen hinter der URL.\n\n![Link](/images/markdown-guide/link.jpg)\n\nDie meisten Markdown-Editoren erzeugen aus URLs und E-Mail-Adressen automatisch klickbare Hyperlinks. Um dies zu forcieren, setzen Sie die URL zwischen Kleiner- und Größer-als-Zeichen. Um es zu verhindern, markieren Sie die URL als Code.\n\n![Link](/images/markdown-guide/link2.jpg)\n\n\n## Bilder\nMöchten Sie ein Bild einfügen, beginnen Sie mit einem Ausrufezeichen. Im Anschluss schreiben Sie eckige Klammern, in denen sich der alternative Text zum Bild befindet. Danach folgt in runden Klammern die URL oder der Pfad.\n\n![Bild](/images/markdown-guide/image.jpg)\n\n\n### Lokale Bilderpfad\nMöchten SIe ein lokales Bild in ihr Markdownfile einbinden, wird dieses Bild im public Ordner der Applikation abgelegt. Der Pfad zum Bild ist kein absoluter Pfad, sondern ein Pfad beginnend aus dem public Ordner\n\nBeispiel Pfad: /images/markdown-guide/image.jpg\n\n\n## Verlinkte Bilder\nBilder und Hyperlinks lassen sich auch kombinieren. Wenn Sie hinter das Bild einen klickbaren Link setzen möchten, verschachteln Sie die beiden Funktionen miteinander. Das Bild wird hier zum Ankertext und taucht deshalb in den eckigen Klammern auf.\n\n![Verlinktes Bild](/images/markdown-guide/linked-image.jpg)\n\n\n## Tabellen\nMit Pipes (|) lassen sich in Markdown Tabellen zeichnen. Jede Zelle wird durch eine Pipe getrennt. Um Kopfzeilen zu erzeugen, die sich optisch vom restlichen Inhalt absetzen, unterstreichen Sie die entsprechenden Zellen mit Bindestrichen.\n\n![Tabelle](/images/markdown-guide/table.jpg)\n\n\n## Fußnoten\nIn den Fließtext schreiben Sie eine Anmerkungsziffer und lösen diese am Ende der Seite in der Fußnote auf – eine entsprechende Linie wird dabei automatisch erzeugt. Die Anmerkungsziffer ist als Hyperlink formatiert, sodass man bei einem Klick darauf direkt zur entsprechenden Fußnote gelangt. Dafür setzen Sie zuerst die Anmerkungsziffer hinter das gewünschte Wort: In eckigen Klammern schreiben Sie erst ein Zirkumflex und dann die Nummer.\n\nWelche Nummer (auch andere Begriffe sind möglich) Sie einsetzen, ist egal. Wichtig ist, dass Sie die gewählte Bezeichnung auch wieder korrekt auflösen. Dafür setzen Sie die gleiche Ziffer in einer neuen Zeile wieder mit Zirkumflex in eine Klammer, fügen einen Doppelpunkt hinzu und schreiben dann die eigentliche Anmerkung. Diese kann zusätzlich umfassend formatiert werden und sich auch über mehrere Zeilen erstrecken.\n\n![Fußnote](/images/markdown-guide/footnote.jpg)\n\n\n## Backslash-Maskierung\nMarkdown nutzt spezifische Symbole zur Auszeichnung, auf die der Parser beim Konvertieren reagiert.\n\n- Asterisk: *\n- Bindestrich:\n- Unterstrich: _\n- Runde Klammern: ()\n- Eckige Klammern: []\n- Geschweifte Klammern: {}\n- Punkt: .\n- Ausrufezeichen: !\n- Raute: #\n- Akzent: `\n- Backslash: \\\n\nMöchten Sie diese Zeichen in ihrer eigentlichen Bedeutung verwenden, setzen Sie jeweils einen Backslash davor.\n\n![Backslash-Maskierung](/images/markdown-guide/backslash.jpg)"},"__N_SSG":true}