{"pageProps":{"frontmatter":{},"content":"# Anleitung zur Navigation\n\n  \n\n## Einleitung\nDie Navigation kann automatisch oder manuell erzeugt werden. \nAußerdem gibt es eine Auswahl zwischen verschiedenen Layouts.  \n\n1. [Navigation automatisch oder manuell erzeugen](#Navigation-automatisch-oder-manuell-erzeugen)\n2. [Layout der Navigation anpassen](#Layout-der-Navigation-anpassen)\n3. [Übersicht Layouts](#Übersicht-Layouts)\n\n  \n\n## Navigation automatisch oder manuell erzeugen  \n\nOb die Navigation automatisch oder manuell erzeugt wird, wird in der Datei settings.json in dem Wert \"autonavi\" festgelegt.\n\nZur Änderung der Einstellung öffnen Sie die Datei settings.json im Code-Editor unter pages/post/settings.json, weisen den gewünschten Wert zu und speichern anschließend.  \n\nMit dem Wert *true* wird die automatische Generierung der Navigation eingeschaltet. Mit dem Wert *false* wird die automatische Genrerierung der Navigation ausgeschaltet.\n\n  \n\n## Layout der Navigation anpassen  \n\nFür die Darstellung der Navigation kann zwischen drei verschiedenen responsive Layouts ausgewählt werden.  \nEs gibt ein responsive Layout mit Top Navigation und zwei responsive Layouts mit Sidebar.  \n\nZur Änderung des Layouts der Navigation öffnen Sie die Datei _app.js im Code-Editor unter pages/_app.js.\nIn dieser Datei werden alle Layouts importiert:\n  \n*// import '../styles/globals.css';*  \n*// import '../styles/globals_sidebar.css';*  \n*import '../styles/globals_sidebar_2.css';*  \n\nMit der Zeile *// import '../styles/globals.css';* &nbsp;wird das **Layout mit Top Navigation** importiert.  \nMit der Zeile *// import '../styles/globals_sidebar.css';* &nbsp;wird das **Layout mit Sidebar Version 1** importiert.  \nMit der Zeile *import '../styles/globals_sidebar_2.css';* &nbsp;wird das **Layout mit Sidebar Version 2** importiert.\n\nDie nicht-aktiven Layouts werden mit // auskommentiert bzw. ausgeschaltet.  \nIn unserem Beispiel ist also das **Layout mit Sidebar Version 2** aktiv.\n\n  \n\n## Übersicht Layouts\n\n**Layout mit Top Navigation**: Bei diesem Layout befindet sich die Navigation oben auf der Website. Untermenü-Punkte werden bei Mouseover eingeblendet. Top-Navigation Layouts eignet sich am besten für Websites mit wenigen Menüpunkten.\n\n**Layout mit Sidebar Version 1**: Bei diesem Layout befindet sich die Navigation links an der Seite der Webiste. Untermenü-Punkte werden eingerückt. Sidebar Layouts eignen sich am besten für Websites mit vielen Menüpunkten. Die Elemente sind abgerundet.\n\n**Layout mit Sidebar Version 2**: Bei diesem Layout befindet sich die Navigation links an der Seite der Webiste. Untermenü-Punkte werden eingerückt. Sidebar Layouts eignen sich am besten für Websites mit vielen Menüpunkten. Die Elemente sind eckig und die Abstände sind schmal."},"__N_SSG":true}